**** DONE New version of map script
CLOSED: [2024-05-09 Thu 13:11]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-05-09 Thu 13:11] \\
  Re-run this for all PZ cubes after doing the column trimming
:END:
- The yaml files are in [[file:../data/n346-lines/all-lines-orig/]]
- I will make a new folder [[file:../data/n346-bow-lines/]] to store the maps
  - This will have sub-folders named after the particular median-filtered cube, such as [[file:../data/n346-bow-lines/maps-n346-PZ-2pass-csub-007/]]
- Unlike previous scripts, this finds all paths relative to the project root directory, which may or may not be a good idea
  - We can run it from the [[file:../scripts/]] directory or the [[file:../data/]] directory, or anywhere else that is one level down from the project root (or otherwise use the ~--project-root~ option)
#+begin_src python :tangle ../scripts/make-all-3wav-maps.py
  import numpy as np
  import sys
  from pathlib import Path
  import typer
  import yaml
  import slugify
  from text_unidecode import unidecode
  from astropy.io import fits
  from astropy.wcs import WCS

  unwanted_types = ["sky", "telluric", "noise", "nan", "stellar"]


  def get_line_type(s):
      if s is None:
          return None
      ltype = slugify.slugify(str(s).rstrip("?"))
      if not ltype or ltype in unwanted_types:
          return None
      else:
          return ltype


  def load_cube_hdu(
      cube_path: Path,
  ):
      return fits.open(cube_path)[0]


  def get_id_string(data):
      s = f"{data['Index']:04d}-"
      s += slugify.slugify(data["ID"])
      if "UIL" in data["ID"]:
          s += "-" + slugify.slugify(f"{data['lambda_HM']:.2f}")
      return s


  def main(
      cube_file: str = "n346-muse-2pass-csub-007.fits",
      project_root: Path = Path("../"),
      yaml_folder: str = "data/n346-lines/all-lines-orig",
      maps_folder: str = "data/n346-bow-lines",
  ):
      """Create ABC channel maps of all emission lines from data in YAML files"""


      # Get the spectral cube
      big_data_folder = project_root / "big-data" / "ngc346new"
      cube_path = big_data_folder / f"{cube_file}"
      cube = load_cube_hdu(cube_path)

      # The YAML files contain metadata for each line
      yaml_files = (project_root / yaml_folder).glob("*.yaml")
      # Loop over all the lines
      for yaml_file in yaml_files:
          with open(yaml_file) as f:
              metadata = yaml.safe_load(f)
          # Group all lines of same type into their own folder
          line_type = get_line_type(metadata["Type"])
          if line_type is None:
              # Skip unwanted types
              continue

          # Make folder for this line type if necessary
          save_path = project_root / maps_folder / f"maps-{cube_path.stem}" / f"type-{line_type}" 
          save_path.mkdir(exist_ok=True, parents=True)

          ipeak = metadata["Index"]
          # Save each of 3 channels as a separate FITS file
          images = {}
          for chan_label, ichan in zip(["A", "B", "C"], [ipeak - 1, ipeak, ipeak + 1]):
              images[chan_label] = cube.data[ichan, ...]
          # And also the moments
          images["ABC"] = images["A"] + images["B"] + images["C"]
          images["m1"] = (images["C"] - images["A"]) / images["ABC"]
          images["m2"] = (images["C"] + images["A"]) / images["ABC"]
          header = WCS(cube.header).celestial.to_header()
          # FITS headers allow only ASCII strings
          header.update({k: unidecode(str(v)) for k, v in metadata.items()})
          for label, image in images.items():
              fits_file = get_id_string(metadata) + f"-{label}.fits"
              fits.PrimaryHDU(header=header, data=image).writeto(
                  save_path / fits_file, overwrite=True
              )
          print("Image saved to", save_path / f"{get_id_string(metadata)}-*.fits")


  if __name__ == "__main__":
      typer.run(main)
#+end_src



#+begin_src sh :dir ../data :results verbatim :eval no
python ../scripts/make-all-3wav-maps.py --cube-file n346-muse-2pass-csub-007.fits
#+end_src

#+begin_src sh :dir ../data :results verbatim
python ../scripts/make-all-3wav-maps.py --help 
#+end_src

#+RESULTS:
#+begin_example
                                                                                
 Usage: make-all-3wav-maps.py [OPTIONS]                                         
                                                                                
 Create ABC channel maps of all emission lines from data in YAML files          
                                                                                
╭─ Options ────────────────────────────────────────────────────────────────────╮
│ --cube-file           TEXT  [default: n346-muse-2pass-csub-007.fits]         │
│ --project-root        PATH  [default: ..]                                    │
│ --yaml-folder         TEXT  [default: data/n346-lines/all-lines-orig]        │
│ --maps-folder         TEXT  [default: data/n346-bow-lines]                   │
│ --help                      Show this message and exit.                      │
╰──────────────────────────────────────────────────────────────────────────────╯

#+end_example
*** DONE Define a background (BG) zone
CLOSED: [2024-05-10 Fri 13:26]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-05-10 Fri 13:26] \\
  Decided to go for a border of 10 pixels to avoid the noise around the edges
:END:
- It looks like I may be able to improve things by subtracting off a background, so I am next going to define a new zone to the north of the map where there is very little emission apart from some neutral lines
- Looking at the zone-*-bright-map.fits files, it looks like a combination of two criteria will work:
  - III < -0.1
  - S < 0.2
- This will select a couple of regions in the north where nothing is happening


#+begin_src python :tangle ../scripts/make-bg-zone-mask.py 
  from pathlib import Path
  import numpy as np
  from astropy.io import fits
  import yaml
  import typer

  def trim_pixel_border_from_mask(mask: np.ndarray, border: int) -> np.ndarray:
      """Set to False all pixels within certain border of mask array"""
      assert mask.ndim == 2
      mask2 = np.zeros_like(mask)
      # Easier to set the pixels that we do not want to set to FALSE
      mask2[border:-border,  border:-border] = True
      # and just AND it with the original
      return mask & mask2

  BG_THRESHOLDS = [("III", -0.1), ("S", 0.2)]


  def main(
          trim_border: int=5,
  ):
      """Write a fits image file for the BG zone mask"""

      # Initialise the mask to all True
      mask = None
      # For each criterion, set to False any pixels that do not meet it
      for zlabel, threshold in BG_THRESHOLDS:
          zone_bright_map = fits.open(f"zone-{zlabel}-bright-map.fits")[0]
          if mask is None:
              mask = zone_bright_map.data < threshold
          else:
              mask = mask & (zone_bright_map.data < threshold)
      # And trim around the border to avoid noisy pixels
      mask = trim_pixel_border_from_mask(mask, trim_border)
      maskfilename = f"zone-BG-mask.fits"
      fits.PrimaryHDU(
          header=zone_bright_map.header,
          data=mask.astype(int),
      ).writeto(maskfilename, overwrite=True)
      print("Saved mask to", maskfilename)

  if __name__ == "__main__":
      typer.run(main)

  #+end_src

  #+RESULTS:

#+begin_src sh :results output verbatim :dir ../data/n346-lines
  python ../../scripts/make-bg-zone-mask.py --trim-border 10
#+end_src

#+RESULTS:
: Saved mask to zone-BG-mask.fits
*** DONE Generate the masked cube for the BG zone
CLOSED: [2024-05-10 Fri 13:35]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-05-10 Fri 13:35] \\
  Done for 3 PZ windows and one ESO window
:END:
#+header: :prologue "exec 2>&1" :epilogue ":"
#+begin_src sh :results output verbatim :dir ../data/n346-lines
  z=BG
  time for w in 007 011 101; do
      python ../../scripts/make-masked-cube.py \
       ../../big-data/ngc346new/n346-PZ-2pass-csub-$w.fits \
       zone-$z-mask.fits \
       zone-$z
  done
  echo "Last run:"
  date
#+end_src

#+RESULTS:
: WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
: WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
: WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
: 
: real	1m6.621s
: user	0m31.011s
: sys	0m20.328s
: Last run:
: Fri May 10 13:30:22 CST 2024

Repeat for the ESO cube
#+begin_src sh :results output verbatim :dir ../data/n346-lines
  z=BG
  time for w in 007; do
      python ../../scripts/make-masked-cube.py \
       ../../big-data/ngc346new/n346-muse-2pass-csub-$w.fits \
       zone-$z-mask.fits \
       zone-$z
  done
  echo "Last run:"
  date
#+end_src

#+RESULTS:
: Last run:
: Fri May 10 13:44:59 CST 2024

*** DONE Generate the masked cubes for each zone
CLOSED: [2024-05-09 Thu 11:39]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-05-09 Thu 11:39] \\
  Done for 007, 011, and 101
:END:
First the 007 window
#+header: :prologue "exec 2>&1" :epilogue ":"
#+begin_src sh :results output verbatim :dir ../data/n346-lines
  time for z in 0 I II III IV MYSO S BG; do
      python ../../scripts/make-masked-cube.py \
       ../../big-data/ngc346new/n346-PZ-2pass-csub-007.fits \
       zone-$z-mask.fits \
       zone-$z
  done
  echo "Last run:"
  date
#+end_src

#+RESULTS:
#+begin_example
WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]

real	2m7.901s
user	1m13.664s
sys	0m42.645s
Last run:
Thu May  9 11:27:34 CST 2024
#+end_example

Now the 101 window. This one I run in the terminal so as not to block the notebook. And I do the same for the 011 window

#+header: :prologue "exec 2>&1" :epilogue ":"
#+begin_src sh :results output verbatim :dir ../data/n346-lines :eval no
  time for z in I II III IV MYSO S; do
      python ../../scripts/make-masked-cube.py \
       ../../big-data/ngc346new/n346-PZ-2pass-csub-101.fits \
       zone-$z-mask.fits \
       zone-$z
  done
  echo "Last run:"
  date
#+end_src

Somehow I forgot the Zone 0 case

#+header: :prologue "exec 2>&1" :epilogue ":"
#+begin_src sh :results output verbatim :dir ../data/n346-lines
  z=0
  time for w in 007 011 101; do
      python ../../scripts/make-masked-cube.py \
       ../../big-data/ngc346new/n346-PZ-2pass-csub-$w.fits \
       zone-$z-mask.fits \
       zone-$z
  done
  echo "Last run:"
  date
#+end_src

#+RESULTS:
: WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
: WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
: WARNING: UnitsWarning: '1e-20 erg/s/cm  2/Angstrom' contains multiple slashes, which is discouraged by the FITS standard [astropy.units.format.generic]
: 
: real	1m1.540s
: user	0m30.565s
: sys	0m18.825s
: Last run:
: Thu May  9 11:56:20 CST 2024

*** DONE Extract the spectra from each zone
CLOSED: [2024-05-09 Thu 13:06]
:LOGBOOK:
- State "DONE"       from "TODO"       [2024-05-09 Thu 13:06] \\
  Finished the version with mean and without any chopping off for all the PZ windows and the 007 ESO window
:END:
Unlike with the previous project, we do not necessarily want to chop off the south filament, so we will initially try it with the entire cube

#+header: :prologue "exec 2>&1" :epilogue ":"
#+begin_src sh :results output verbatim :dir ../data/n346-bow-lines
  time for z in 0 I II III IV MYSO S; do
      python ../../scripts/extract-zone-spectrum.py \
       ../../big-data/ngc346new/n346-PZ-2pass-csub-007-zone-$z.fits \
       zone-$z-P-007-mean
  done
  echo "Last run:"
  date
#+end_src

#+RESULTS:
: /Users/will/Dropbox/muse-hii-regions/data/n346-bow-lines/../../scripts/extract-zone-spectrum.py:14: RuntimeWarning: Mean of empty slice
:   spec = reduction_method(
: 
: real	0m57.864s
: user	0m25.488s
: sys	0m13.890s
: Last run:
: Thu May  9 11:57:26 CST 2024

Also done for the 011 and 101 windows. And for the ESO cube with 007 window

Repeat for the new BG zone

#+header: :prologue "exec 2>&1" :epilogue ":"
#+begin_src sh :results output verbatim :dir ../data/n346-bow-lines
  z=BG
  time python ../../scripts/extract-zone-spectrum.py \
         ../../big-data/ngc346new/n346-PZ-2pass-csub-007-zone-$z.fits \
         zone-$z-P-007-mean
  time python ../../scripts/extract-zone-spectrum.py \
         ../../big-data/ngc346new/n346-PZ-2pass-csub-011-zone-$z.fits \
         zone-$z-P-011-mean
  time python ../../scripts/extract-zone-spectrum.py \
         ../../big-data/ngc346new/n346-PZ-2pass-csub-101-zone-$z.fits \
         zone-$z-P-101-mean
  time python ../../scripts/extract-zone-spectrum.py \
         ../../big-data/ngc346new/n346-muse-2pass-csub-007-zone-$z.fits \
         zone-$z-E-007-mean
  echo "Last run:"
  date
#+end_src

#+RESULTS:
#+begin_example
/Users/will/Dropbox/muse-hii-regions/data/n346-bow-lines/../../scripts/extract-zone-spectrum.py:14: RuntimeWarning: Mean of empty slice
  spec = reduction_method(

real	0m4.090s
user	0m3.313s
sys	0m1.645s
/Users/will/Dropbox/muse-hii-regions/data/n346-bow-lines/../../scripts/extract-zone-spectrum.py:14: RuntimeWarning: Mean of empty slice
  spec = reduction_method

real	0m4.043s
user	0m3.340s
sys	0m1.603s

real	0m4.047s
user	0m3.318s
sys	0m1.601s

real	0m4.100s
user	0m3.355s
sys	0m1.612s
Last run:
Fri May 10 13:45:43 CST 2024
#+end_example

*** Some lines that may need tweaking
- The [Ar IV] aurora lines are a bit weird
  - I suspect that the central pixel may be off by one in some cases
  - [Ar IV] 7170.5 has no obvious blend
    - actually this one might be well-centered after all
      |         |   A |   B |    C |    m1 |   m2 |
      |---------+-----+-----+------+-------+------|
      | BG      | 3.5 | 4.0 | -2.2 | -1.08 | 0.25 |
      | BS      | 5.5 | 6.7 | -1.3 | -0.62 | 0.39 |
      | BS - BG | 2.0 | 2.7 |  0.9 | -0.20 | 0.52 |
      |         |     |     |      |   0/0 |  0/0 |
      #+TBLFM: $5=($4-$2)/($2 + $3 + $4);f2::$6=($4+$2)/($2 + $3 + $4);f2::@4$2..@4$4=@3-@2;f1
    - 
  - [Ar IV] 7237.4 has a blend with an H_2 line, so is listed under that
  - [Ar IV] 7262.7 has a blend with [Cl IV] 7261.4, but it is not so apparent
*** Usage documentation for the comparison script
#+begin_src sh :dir ../data/n346-bow-lines :results verbatim
python ../../scripts/compare-two-maps.py --help 
#+end_src

#+RESULTS:
#+begin_example
                                                                                
 Usage: compare-two-maps.py [OPTIONS]                                           
                                                                                
╭─ Options ────────────────────────────────────────────────────────────────────╮
│ --acombo                                       TEXT     [default: P-007]     │
│ --bcombo                                       TEXT     [default: E-007]     │
│ --line                                         TEXT     [default:            │
│                                                         h-i-6562-79]         │
│ --histogram-gamma                              FLOAT    [default: 2.0]       │
│ --smooth                                       FLOAT    [default: 0.0]       │
│ --mask-out-stars        --no-mask-out-stars             [default:            │
│                                                         no-mask-out-stars]   │
│ --star-mask-thresho…                           FLOAT    [default: 10.0]      │
│ --star-map-path                                PATH     [default:            │
│                                                         /Users/will/Dropbox… │
│ --zones-folder                                 PATH     [default:            │
│                                                         /Users/will/Dropbox… │
│ --subtract-bg           --no-subtract-bg                [default:            │
│                                                         no-subtract-bg]      │
│ --trim-edges                                   INTEGER  [default: 0]         │
│ --vsys                                         FLOAT    [default: 171.1]     │
│ --mark-moments-bow-…    --no-mark-moments-…             [default:            │
│                                                         no-mark-moments-bow… │
│ --mark-moments-nebu…    --no-mark-moments-…             [default:            │
│                                                         no-mark-moments-neb… │
│ --mark-moments-fila…    --no-mark-moments-…             [default:            │
│                                                         no-mark-moments-fil… │
│ --help                                                  Show this message    │
│                                                         and exit.            │
╰──────────────────────────────────────────────────────────────────────────────╯

#+end_example

*** DONE Debugging the comparison script
CLOSED: [2024-05-21 Tue 13:33]
#+header: :prologue "exec 2>&1" :epilogue ":"
#+begin_src sh :dir ../data/n346-bow-lines :results output verbatim
  python ../../scripts/compare-two-maps.py --line h-i-8345-55 --bcombo P-101 --smooth 3 --mask-out-stars --star-mask-threshold 10 --subtract-bg --fix-continuum --debug
#+end_src

#+RESULTS:
: Clipping input data to the valid range for imshow with RGB data ([0..1] for floats or [0..255] for integers).
: Clipping input data to the valid range for imshow with RGB data ([0..1] for floats or [0..255] for integers).
: Hyper-local continuum: -4.60, -3.06
: Subtracting hyper-local continuum from RGB and ABC images
: Median m2 = 0.6127645104718388 original m2 = 0.5414611150166987
: maps-compare/P-007-P-101-h-i-8345-55.pdf

